{"url": "https://discord.com/channels/827546555200438332/1034892418165768193", "post_id": "1034892418165768193", "user_id": "176759285366128641", "tags": [""], "title": "space new command not editing .gitignore file", "body": "Hey, Quick note regarding the [documentation](https://alpha.deta.space/docs/en/introduction/first-app#creating-a-project). By using space new you say: The CLI also created a hidden .space directory locally which contains information necessary to work with your project in Builder. This file should not be included in your version control and was automatically added to your .gitignore, if you have initialized a Git repository. But in reality the change was not made... (here's my .gitignore file after the changes. Attached a screenshot of the modified files. \n```py \n# Logs \nlogs \n*.log \nnpm-debug.log* \nyarn-debug.log* \nyarn-error.log* \npnpm-debug.log* \nlerna-debug.log* \n \nnode_modules \ndist \ndist-ssr \n*.local \n \n# Editor directories and files \n.vscode/* \n!.vscode/extensions.json \n.idea \n.DS_Store \n*.suo \n*.ntvs* \n*.njsproj \n*.sln \n*.sw? \n```", "attachments": ["https://cdn.discordapp.com/attachments/1034892418165768193/1034892418300002374/unknown.png"], "date_time": "26/10/2022-20:12", "predicted_solution": "probably you have an older cli that didn't haev this capability in it. cc @sponge  thanks for letting us know!"}
{"url": "https://discord.com/channels/827546555200438332/1035650981926547557", "post_id": "1035650981926547557", "user_id": "614810858966614055", "tags": [""], "title": "Project key", "body": "Hi y'all! Given space is meant to deploy across users, how do I dynamically get the project key in the app? or am I misunderstanding?", "attachments": [""], "date_time": "28/10/2022-22:27", "predicted_solution": "it is dynamically generated. you do not need to work with keys we auto configure micros with a DETA_PROJECT_KEY per app. our SDKs look for that key automatically"}
{"url": "https://discord.com/channels/827546555200438332/1038211149503672400", "post_id": "1038211149503672400", "user_id": "380091749026103317", "tags": [""], "title": "SSL CERTIFICATE_VERIFY_FAILED", "body": "Base install of FastAPI running locally with DETA_PROJECT_KEY set in my local env variables.  If I remove the “db.put({“name”:”alex”})” from my endpoint code  then all works again.  Please advise.", "attachments": [""], "date_time": "04/11/2022-23:00", "predicted_solution": "I was able to resolve by running InstallCertificates.command for Python 3.9 in the Applications folder on MacOS.  Now I have a 401 Unauthorized.   So, I will investigate this issue next. Thanks."}
{"url": "https://discord.com/channels/827546555200438332/1040009980427915264", "post_id": "1040009980427915264", "user_id": "380091749026103317", "tags": [""], "title": "Discovery.md not showing information in any Release", "body": "Posted both a listed and unlisted release. Both not showing contents of Discovery.md. The file is located in the root path with the Spacefile. https://alpha.deta.space/discovery/r/bymrz3uaenqtabpv", "attachments": [""], "date_time": "09/11/2022-22:08", "predicted_solution": "install the newest cli version"}
{"url": "https://discord.com/channels/827546555200438332/1046131229650583582", "post_id": "1046131229650583582", "user_id": "680220904839577613", "tags": [""], "title": "Hello, are crons also possible in Deta Space?", "body": "I am looking at a use case that could benefit a lot from crons inside Deta Space. Is that possible? Can I use a package like node-cron for setting up a cron task, and serving an API alongside it? Or is there a native support I'm not aware of inside Deta Space?", "attachments": [""], "date_time": "26/11/2022-19:32", "predicted_solution": "ah node cron will not work, as Deta is 'serverless'. Micros are default 'asleep' but boot up very quickly when requested (e.g. when a cron asks them to)"}
{"url": "https://discord.com/channels/827546555200438332/1003292946583519252/1063556139670831175", "post_id": "", "user_id": "980860560503619614", "tags": [""], "title": "", "body": "Is it possible to change the subdomain of a space app? <change this>.<username>.deta.app", "attachments": [""], "date_time": "13/01/2023-21:32", "predicted_solution": "There are plenty of features which are currently being worked on for Deta Space and custom domain is one of them. Soon but no ETA."}
{"url": "https://canary.discord.com/channels/827546555200438332/1060113260839436308", "post_id": "1060113260839436308", "user_id": "689719765454815266", "tags": [""], "title": "Request limit", "body": "How many request we can make to deta fastapi app? Is there any limit or no limit?", "attachments": [""], "date_time": "04/01/2023-09:31", "predicted_solution": "Currently there is a rate limit of 10 requests per second but that's for testing purpose so not permanent 🙂 And that's only for deta micros. Deta base or drive doesn't have such limit"}
{"url": "https://canary.discord.com/channels/827546555200438332/1058940741285580973", "post_id": "1058940741285580973", "user_id": "791457353139879956", "tags": [""], "title": "Environments", "body": "Do Environments work with deta?", "attachments": [""], "date_time": "01/01/2023-03:52", "predicted_solution": "https://alpha.deta.space/docs/en/basics/micros#micro-environment-variables"}
{"url": "https://canary.discord.com/channels/827546555200438332/1057329051267772487", "post_id": "1057329051267772487", "user_id": "777261944624775189", "tags": [""], "title": "Cron jobs on Deta space", "body": "Hi! I am developping an app that needs to fetch data from an api every two minutes. In Deta cloud you could use cron jobs by defining them using the Deta cli, I don't see an option in the Spacefile documentation for defining cron jobs.  Are the micros on Deta space serverless instances or are they always running? If they are always running I can use a package for handeling cron jobs. But if the micros are serverless instances it isn't possible to use cron jobs. Is there a way to implement cron jobs in my app or do I have to wait until they get implemented? Thanks in advance!", "attachments": [""], "date_time": "27/12/2022-17:08", "predicted_solution": "CRON is planned but not yet supported "}
{"url": "https://canary.discord.com/channels/827546555200438332/1051545504657444904", "post_id": "1051545504657444904", "user_id": "536022316790972426", "tags": [""], "title": "Newbie Questions", "body": "Hey awesome folks, I'm newbie to BE/DB~ stuffs, i have zero knowledge of these things as i have only dealt with things on the FE. I have a UI setup on FE, so i was searching for a fastest way to store data and make CRUD calls. I got to know about Deta Space. I have tried whole lot of other similar offerings (Firebase, etc) but moron me couldn't get it to work. So now you folks have an active community, i would like to know something before i start exploring this space thing. Apologies in advance if these following questions are childish, just that i am a moron. And feel free to delete them if it disqualifies and rated below as per your rules whatever. thanks!  So now that i have installed space, can i now create api using fastifyjs? and then run CRUD ops?  (watching a fastifyjs tutorial while writing this) If then, will i get an endpoint url so that i can make fetch calls from a frontend vue? so if then, can i expect that space has a feature for storing the data?  I might have more questions. I will post them below this same thread as i get them 🙂", "attachments": [""], "date_time": "11/12/2022-18:06", "predicted_solution": "Yep, adding on to sub-G, you just need to make sure fastify is listening on the PORT env and it should work:  - Node (for Fastify): https://alpha.deta.space/docs/en/quickstart-guides/node - Vue: https://alpha.deta.space/docs/en/quickstart-guides/static - Data stuff: https://alpha.deta.space/docs/en/basics/data "}